In [1]:
import pandas as pd

In [2]:
data = {'name' : ['sudh' , 'krish' , 'hitesh' , 'tulesko'],
        'salary' : [100 , 200 , 300 , 400],
        'mail_id' : ['sudh@ineuron.ai' , 'krish@ineuron.ai' , 'hitesh@ineuron.ai' , 'tulesko@ineuron.ai'],
        'addr' : ['blr' , 'blr' , 'blr' , 'mum']
    }

In [3]:
df = pd.DataFrame(data)
df

      name  salary             mail_id addr
0     sudh     100     sudh@ineuron.ai  blr
1    krish     200    krish@ineuron.ai  blr
2   hitesh     300   hitesh@ineuron.ai  blr
3  tulesko     400  tulesko@ineuron.ai  mum

**We can specify manual column names & indexes for the dataframe, but in case of passing a dictionary then it cannot create a df from dict**

In [4]:
df1 = pd.DataFrame(data, index=[1,2,3,4])
df1

      name  salary             mail_id addr
1     sudh     100     sudh@ineuron.ai  blr
2    krish     200    krish@ineuron.ai  blr
3   hitesh     300   hitesh@ineuron.ai  blr
4  tulesko     400  tulesko@ineuron.ai  mum

In [5]:
df1.loc[2:3]

     name  salary            mail_id addr
2   krish     200   krish@ineuron.ai  blr
3  hitesh     300  hitesh@ineuron.ai  blr

In [6]:
df1.iloc[1:3]

     name  salary            mail_id addr
2   krish     200   krish@ineuron.ai  blr
3  hitesh     300  hitesh@ineuron.ai  blr

In [7]:
data = {
    "pf_no" : [12,33,44,55,66],
    "income_tax" : [122,43,55434,65434,6545],
    "mobile" : [12345,2345,23456,34567,4567],
    "courses" : ["ds", "da", "blockchain", "de", "ce"]
}

In [9]:
df1 = pd.DataFrame(data)
df1

   pf_no  income_tax  mobile     courses
0     12         122   12345          ds
1     33          43    2345          da
2     44       55434   23456  blockchain
3     55       65434   34567          de
4     66        6545    4567          ce

In [10]:
df

      name  salary             mail_id addr
0     sudh     100     sudh@ineuron.ai  blr
1    krish     200    krish@ineuron.ai  blr
2   hitesh     300   hitesh@ineuron.ai  blr
3  tulesko     400  tulesko@ineuron.ai  mum

**Concat with default axis = 0 means concat row wise or simply append the values after rows**

In [13]:
pd.concat([df, df1])

,name,salary,mail_id,addr,pf_no,income_tax,mobile,courses
0,sudh,100.0,sudh@ineuron.ai,blr,NaN,NaN,NaN,NaN
1,krish,200.0,krish@ineuron.ai,blr,NaN,NaN,NaN,NaN
2,hitesh,300.0,hitesh@ineuron.ai,blr,NaN,NaN,NaN,NaN
3,tulesko,400.0,tulesko@ineuron.ai,mum,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,12.0,122.0,12345.0,ds
1,NaN,NaN,NaN,NaN,33.0,43.0,2345.0,da
2,NaN,NaN,NaN,NaN,44.0,55434.0,23456.0,blockchain
3,NaN,NaN,NaN,NaN,55.0,65434.0,34567.0,de
4,NaN,NaN,NaN,NaN,66.0,6545.0,4567.0,ce

**Whereas axis=1 means concat column wise**

In [14]:
pd.concat([df, df1], axis=1)

,name,salary,mail_id,addr,pf_no,income_tax,mobile,courses
0,sudh,100.0,sudh@ineuron.ai,blr,12,122,12345,ds
1,krish,200.0,krish@ineuron.ai,blr,33,43,2345,da
2,hitesh,300.0,hitesh@ineuron.ai,blr,44,55434,23456,blockchain
3,tulesko,400.0,tulesko@ineuron.ai,mum,55,65434,34567,de
4,NaN,NaN,NaN,NaN,66,6545,4567,ce

In [21]:
data1 = {
    "emp_id" : [1,2,3,4,5],
    "emp_name" : ["abc","pqr","stre","efd","ewf"],
    "mobile" : [12,34,56,78,9]
}

data2 = {
    "emp_id" : [1,2,3],
    "name" : ["ac","pr","stre"],
    "company" : [12,34,56]
}

In [22]:
df2 = pd.DataFrame(data1)
df3 = pd.DataFrame(data2)

In [23]:
pd.merge(df2, df3)

   emp_id emp_name  mobile  name  company
0       1      abc      12    ac       12
1       2      pqr      34    pr       34
2       3     stre      56  stre       56

In [24]:
pd.merge(df2, df3, how='left')

   emp_id emp_name  mobile  name  company
0       1      abc      12    ac     12.0
1       2      pqr      34    pr     34.0
2       3     stre      56  stre     56.0
3       4      efd      78   NaN      NaN
4       5      ewf       9   NaN      NaN

### **Handling JSON in DataFrame**

In [2]:
data = '{"emp_name" : "ABC", "email" : "abc@gmail.com", "job_profile" : [{"title" : "Team lead", "role" : "Developer"}]}'
data

'{"emp_name" : "ABC", "email" : "abc@gmail.com", "job_profile" : [{"title" : "Team lead", "role" : "Developer"}]}'

In [3]:
type(data)

str

In [6]:
import pandas as pd
df = pd.read_json(data)
df

  emp_name          email                                  job_profile
0      ABC  abc@gmail.com  {'title': 'Team lead', 'role': 'Developer'}

In [10]:
df['title'] = df['job_profile'][0]['title']
df['role'] = df['job_profile'][0]['role']

In [11]:
df

,emp_name,email,job_profile,title,role
0,ABC,abc@gmail.com,"{'title': 'Team lead', 'role': 'Developer'}",Team lead,Developer

In [12]:
pd.read_json(data, orient="records")

  emp_name          email                                  job_profile
0      ABC  abc@gmail.com  {'title': 'Team lead', 'role': 'Developer'}

In [13]:
pd.read_json(data, orient="index")

                                                         0
emp_name                                               ABC
email                                        abc@gmail.com
job_profile  [{'title': 'Team lead', 'role': 'Developer'}]